; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph4 - mode
	infrared3 - mode
	thermograph2 - mode
	image1 - mode
	image0 - mode
	Star4 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image1)
	(supports instrument4 infrared3)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(have_image Star6 image0)
	(have_image Phenomenon7 spectrograph4)
	(have_image Star8 spectrograph4)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 image0)
	(have_image Star11 spectrograph4)
	(have_image Star12 image1)
	(have_image Star13 image0)
))

)

; plan
1. (turn_to satellite1 groundstation3 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 planet9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet9)
   goals met: 0 of 8
5. (take_image satellite1 planet9 instrument3 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 1 of 8
6. (turn_to satellite1 groundstation0 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 8
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
8. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 1 of 8
9. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 8
10. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 8
11. (calibrate satellite1 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 1 of 8
12. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 8
13. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 2 of 8
14. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 8
15. (take_image satellite0 phenomenon7 instrument0 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 3 of 8
16. (turn_to satellite0 star11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star11)
   goals met: 3 of 8
17. (take_image satellite0 star11 instrument0 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 4 of 8
18. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 4 of 8
19. (take_image satellite0 star13 instrument0 image0)
   added: (have_image star13 image0)
   goals met: 5 of 8
20. (turn_to satellite0 star6 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star6)
   goals met: 5 of 8
21. (take_image satellite0 star6 instrument0 image0)
   added: (have_image star6 image0)
   goals met: 6 of 8
22. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 6 of 8
23. (take_image satellite0 star8 instrument0 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 7 of 8
24. (turn_to satellite1 star12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star12)
   goals met: 7 of 8
25. (take_image satellite1 star12 instrument4 image1)
   added: (have_image star12 image1)
   goals met: 8 of 8
